/*
问题描述：
蛇形矩阵是一个n*n的矩阵，将整数1到n*n按照蛇形的顺序装入一个 n*n 的蛇形矩阵中，如样例所示分别为5阶和10阶蛇形矩阵：

输入与输出要求：
输入一个整数n，代表蛇形矩阵的阶数，n的范围是1—100。输出蛇形矩阵。每行的每个元素用空格分隔，注意最后一个数的后面为换行符。

程序运行效果：
Sample 1：
5

1 3 4 10 11
2 5 9 12 19
6 8 13 18 20
7 14 17 21 24
15 16 22 23 25
Sample 2：
10

1 3 4 10 11 21 22 36 37 55
2 5 9 12 20 23 35 38 54 56
6 8 13 19 24 34 39 53 57 72
7 14 18 25 33 40 52 58 71 73
15 17 26 32 41 51 59 70 74 85
16 27 31 42 50 60 69 75 84 86
28 30 43 49 61 68 76 83 87 94
29 44 48 62 67 77 82 88 93 95
45 47 63 66 78 81 89 92 96 99
46 64 65 79 80 90 91 97 98 100
*/

#include <stdio.h>
#include <stdlib.h>
int main(){
    int n;
	scanf("%d",&n);
	int a[n][n];
    a[0][0]=1;
    int i=0,j=0,k=1;
	while(i!=n-1||j!=n-1){
        //向下走
		if(k==1){
			a[i+1][j]=a[i][j]+1;
			i=i+1;
			if(j==0) k=2;
			else if(j==n-1) k=4;
		}
        //向右上方走
		else if(k==2){
			a[i-1][j+1]=a[i][j]+1;
			i=i-1;
            j=j+1;
			if(i==0&&j!=n-1) k=3;
			else if(j==n-1) k=1;
			else k=2;
		}
        //向右走
		else if(k==3){
			a[i][j+1]=a[i][j]+1;
			j=j+1;
			if(i==0) k=4;
			else if(i==n-1) k=2;
		}
        //向左下方走
		else if(k==4){
			a[i+1][j-1]=a[i][j]+1;
			i=i+1,j=j-1;
			if(j==0&&i!=n-1) k=1;
			else if(i==n-1)k=3;
			else k=4; 
		}
	}
	for(int l=0;l<n;l++){
		for(int k=0;k<n;k++){
            printf("%d",a[l][k]);
            if(k==n-1) printf("\n");
            else printf(" ");
		}
	} 
	return 0;
}